[
  {
    "title": "Sentiment",
    "url": "https://airdrops.io/sentiment/",
    "description": "24°\n Airdrop Link: Join points campaign\n Total value: n/a\n❌ Airdrop unconfirmed\n Platform: hyperliquid\n\nWhat is Sentiment Protocol?\n\nSentiment is a decentralized onchain lending protocol that allows users to programmatically lend and borrow digital assets on Ethereum and Layer 2 networks. The protocol facilitates permissionless lending and borrowing through its smart contract system, allowing users to access liquidity without traditional intermediaries.\n\nSentiment distinguishes between different stakeholders who contribute to the production and distribution of the protocol, creating a multi-faceted ecosystem.\n\nThe protocol’s architecture is designed to support various lending pools with different risk parameters, giving users flexibility in how they interact with the platform.\n\nSentiment Protocol Airdrop Details\n\nSentiment has announced a points program that appears to be laying the groundwork for a potential future airdrop. Points will be distributed weekly with an initial cap of 1,000,000 points per week. The points accrual algorithm is specifically designed to incentivize long-term use of the protocol.\n\nInitially, the points distribution will be skewed towards lenders on Sentiment Super Pools, indicating that providing liquidity to these specific pools may be the most efficient way to accumulate points. The team has also mentioned that users should check for weekly updates as there will be multipliers for different actions in the coming weeks, potentially creating new opportunities to earn additional points. A referral program is also live where users can earn more points.\n\nStep-by-Step Guide:\nHow to Participate in the Sentiment Points Program\nVisit the Sentiment website: Navigate to the official Sentiment Protocol website to access the platform.\nConnect your wallet: Click on the “Connect Wallet” button and select your preferred Ethereum wallet (MetaMask, WalletConnect, etc.).\nFund your wallet: Make sure you have HYPE or any other assets you wish to lend in your wallet. If you need to purchase assets, you can buy them from Binance.\nNavigate to the lending section: Find the lending or Super Pools section on the platform interface.\nChoose a Super Pool: Review the available Super Pools and select one that matches your risk tolerance and contains assets you’re willing to lend.\nLend your assets: Input the amount you wish to lend and approve the transaction. Complete the transaction by confirming it in your wallet.\nMonitor your points: Check your points accumulation regularly through the platform’s dashboard or dedicated points page.\nRefer your friends to earn more points.\nFrequently Asked Questions\nHow often are Sentiment points distributed?\n\nSentiment points are distributed weekly, with updates typically occurring on the same day each week. Users should check the platform regularly to track their accumulation.\n\nIs there a cap on the number of points distributed?\n\nYes, there is an initial cap of 1,000,000 points per week. This cap may be adjusted in the future based on protocol growth and participation.\n\nWill all points-earning activities carry the same weight?\n\nNo, the protocol has mentioned that initially, points will be skewed towards lenders on Sentiment Super Pools. Additionally, there will be multipliers for different actions in the coming weeks, suggesting that some activities will be more valuable than others for points accumulation.\n\nWhen will the referral program launch?\n\nThe referral program is now live.\n\nConclusion\n\nThe Sentiment Protocol points program presents an opportunity for users to engage with a decentralized lending platform while potentially positioning themselves for future rewards. By following the step-by-step guide and implementing the strategies outlined in this article, you can maximize your chances of accumulating significant points.\n\nYou're interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our list of potential retroactive airdrops to not miss out on the next DeFi airdrop!\n\nDon't forget to follow us on Twitter, Telegram, & Facebook and subscribe our newsletter to receive new airdrops!\n\nJOIN POINTS CAMPAIGN \n\n Report Issue",
    "steps": []
  },
  {
    "title": "Garden Finance",
    "url": "https://airdrops.io/garden-finance/",
    "description": "60°\n Airdrop Link: BRIDGE BTC\n Total value: n/a\n✅ Airdrop confirmed\n Platform: arbitrum, base, eth, hyperliquid, optimism, starknet\n\nWhat is Garden Finance?\n\nGarden Finance is a Bitcoin-native bridge designed to enable seamless cross-chain transfers of Bitcoin (BTC) and related assets across multiple blockchain networks. The platform facilitates the movement of BTC liquidity directly into ecosystems like Starknet, allowing Bitcoin holders to interact with decentralized applications (dApps) on other chains. Garden Finance supports various assets including Bitcoin (BTC), Wrapped Bitcoin (wBTC), Coinbase Bitcoin (cbBTC), and USDC, providing a fast bridging solution that completes transactions in approximately 30 seconds.\n\nAt its core, Garden Finance addresses a significant challenge in the cryptocurrency space – the ability to use Bitcoin in decentralized finance (DeFi) environments beyond its native blockchain. By utilizing a non-custodial model audited by Trail of Bits, the platform offers secure cross-chain transfers to networks such as Ethereum, Base, Arbitrum, Berachain, and Hyperliquid.\n\nGarden Finance Airdrop Details\n\nGarden Finance is currently running the “Garden Campaign,” a structured initiative designed to incentivize user participation through a gamified rewards system. While specific token distribution details aren’t yet confirmed, the campaign functions as a points-based system where users complete various tasks related to bridging assets and interacting with the Garden Finance ecosystem. These points likely indicate future benefits such as potential token airdrops, governance rights, or other ecosystem perks.\n\nThe campaign frames participation as “leveling up,” creating a play-to-earn structure that rewards users for completing specific actions within the Garden Finance ecosystem. As with many DeFi projects, early adopters and active participants may position themselves favorably for any future token distributions, with 68 million SEED tokens remaining to be awarded as community incentives (46% of total SEED supply). Act 1 rewarded users with 12 million SEED tokens, while Act 2 is currently in progress and is likely to also reward users with an airdrop.\n\nStep-by-Step Guide:\nHow to Participate in the Garden Finance Airdrop\nCreate a compatible wallet: Set up a wallet that supports EVM networks (Rabby recommended)\nAcquire BTC or compatible assets: Ensure you have Bitcoin (BTC), Wrapped Bitcoin (wBTC), Coinbase Bitcoin (cbBTC), or USDC available to bridge. If you need to purchase BTC or USDC, you can buy these assets on Binance.\nVisit the Garden Finance platform: Navigate to the official Garden Finance webapp.\nConnect your wallet: Link your compatible wallet to the Garden Finance platform.\nSelect assets to bridge: Choose which assets you want to transfer to Starknet or other supported networks.\nSpecify the destination: Select your destination chain.\nInitiate the bridge transfer: Follow the prompts to send your assets across the bridge.\nConfirm the transaction: Verify and approve the transaction in your wallet.\nWait for completion: The bridging process should complete in approximately 30 seconds.\nTrack your campaign progress: Monitor your participation status and completed tasks through the Garden Finance dashboard.\nGarden Finance Bridge Technology\n\nGarden Finance differentiates itself through several key technological aspects that make its bridging solution particularly effective for Bitcoin holders looking to access DeFi opportunities.\n\nIntent-Based Bridging\n\nUnlike traditional bridging methods that can be slow and complex, Garden Finance utilizes intent-based technology to facilitate faster cross-chain transfers. This approach streamlines the process by focusing on the user’s intended destination for their assets rather than requiring multiple technical steps, resulting in transactions that complete in approximately 30 seconds – significantly faster than many competing solutions.\n\nSecurity Architecture\n\nThe platform operates using a non-custodial model, which means users maintain control of their assets throughout the bridging process. This reduces custody risks commonly associated with centralized bridges. Additionally, Garden Finance has undergone a security audit by Trail of Bits, a respected security firm in the blockchain space, enhancing trust in the platform’s security posture.\n\nFAQs\nWhat makes Garden Finance different from other Bitcoin bridges?\n\nGarden Finance distinguishes itself through its speed (30-second transactions), non-custodial security model, and specialized focus on bridging Bitcoin assets to Starknet. While many bridges exist in the cryptocurrency ecosystem, Garden Finance specifically targets the integration of Bitcoin liquidity into emerging DeFi platforms, particularly on layer-2 solutions.\n\nDo I need technical knowledge to participate in the Garden Campaign?\n\nThe Garden Campaign is designed to be accessible to users with varying levels of technical expertise. While basic knowledge of cryptocurrency wallets and transactions is helpful, the platform aims to simplify the bridging process. The campaign’s structure is intended to be user-friendly, with clear instructions for completing each task.\n\nWhat are the potential rewards for participating?\n\nWhile specific rewards haven’t been explicitly detailed, the campaign utilizes a points-based system typical of projects that later distribute governance tokens or other benefits. Participants likely earn points for completing tasks that may translate to airdrops, governance rights, or other ecosystem advantages as the project matures.\n\nIs there a minimum amount required to participate?\n\nThe available information doesn’t specify minimum bridging amounts. However, users should consider transaction fees when determining appropriate amounts to bridge. Smaller amounts may result in fees consuming a disproportionate percentage of the transferred value.\n\nHow long will the Garden Campaign run?\n\nThe campaign’s duration has not been explicitly stated. For the most current information about timeframes, follow @garden_finance on X or visit the official website.\n\nConclusion\n\nGarden Finance addresses a fundamental need in the cryptocurrency ecosystem by enabling Bitcoin holders to participate in DeFi activities across multiple blockchains. The Garden Campaign offers an opportunity to engage with this infrastructure while potentially positioning yourself for future benefits.\n\nFor Bitcoin holders looking to explore DeFi opportunities beyond Bitcoin’s native blockchain, Garden Finance provides a faster, secure bridging solution. The campaign’s gamified structure adds an engaging element to what would otherwise be standard bridge transactions.\n\nWhether participation makes sense for you depends on your interest in DeFi, your comfort with early-stage projects, and your willingness to engage with cross-chain activities. By following the steps outlined in this guide, you can make an informed decision about joining the Garden Campaign and potentially benefit from being an early adopter of this Bitcoin-native bridging technology.\n\nFor the latest updates and detailed information about the Garden Campaign, follow @garden_finance on X or visit the official Garden Finance website.\n\nYou're interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our list of potential retroactive airdrops to not miss out on the next DeFi airdrop!\n\nDon't forget to follow us on Twitter, Telegram, & Facebook and subscribe our newsletter to receive new airdrops!\n\nBRIDGE BTC \n\n Report Issue",
    "steps": []
  },
  {
    "title": "Polymer",
    "url": "https://airdrops.io/polymer/",
    "description": "44°\n Airdrop Link: Earn Discord role\n Total value: n/a\n❌ Airdrop unconfirmed\n Platform: eth\n\nWhat is Polymer?\n\nPolymer is a purpose-built rollup designed to solve interoperability challenges between different blockchain rollups. The project addresses a critical pain point in the current blockchain landscape – the fragmentation caused by numerous separate Ethereum rollup ecosystems.\n\nPolymer’s technology allows users to execute and verify actions across multiple chains in real-time, offering what they describe as the fastest latency available in the cross-chain messaging space.\n\nThe project has gained significant backing from prominent investors, having raised $26.6 million in funding from venture capital firms including Blockchain Capital.\n\nPolymer Airdrop Details\n\nThe Polymer airdrop appears to be structured around a chapter-based completion system that rewards users who engage with the project’s community and complete specific tasks.\n\nCurrently, the airdrop is speculative, with participants who complete all five chapters earning a “Graduate” role within the community. This role could potentially qualify members for future token distribution, though exact reward details haven’t been officially confirmed.\n\nStep-by-Step Guide:\nHow to Participate in the Polymer Airdrop\nJoin the Polymer Discord community\nLocate the Chapters channels – Once inside the Discord server, head to the Chapters section where you’ll find the tasks organized in sequential order.\nBegin with Chapter 1 – Start with the first chapter and complete all required tasks. Pay attention to verification requirements for each task.\nProgress through subsequent chapters – Each chapter unlocks the next one upon completion. Work through Chapters 2-5 in sequence.\nEarn the Graduate role – After completing all five chapters, you should receive the Graduate role in the Discord server, potentially making you eligible for future token rewards.\nFrequently Asked Questions\nWhat makes Polymer different from other cross-chain solutions?\n\nPolymer distinguishes itself by focusing specifically on rollup interoperability with an emphasis on speed and security.\n\nDo I need to hold any specific tokens to participate?\n\nBased on the available information, participation in the chapter-based program doesn’t require holding specific tokens.\n\nIs there a deadline for completing the chapters?\n\nNo specific deadline has been announced for chapter completion. However, with airdrops, earlier participation is generally better as requirements might change or the program might conclude without notice.\n\nConclusion\n\nThe Polymer project addresses a fundamental challenge in the blockchain ecosystem by improving interoperability between different rollups. By participating in their chapter-based community program, users can engage with this technology while potentially positioning themselves for future rewards.\n\nCompleting all five chapters and earning the Graduate role requires dedication but offers accessible entry into the Polymer ecosystem without requiring significant existing crypto holdings.\n\nYou're interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our list of potential retroactive airdrops to not miss out on the next DeFi airdrop!\n\nDon't forget to follow us on Twitter, Telegram, & Facebook and subscribe our newsletter to receive new airdrops!\n\nEARN DISCORD ROLE \n\n Report Issue",
    "steps": []
  },
  {
    "title": "Collective Memory",
    "url": "https://airdrops.io/collective-memory/",
    "description": "32°\n Airdrop Link: Join points campaign\n Total value: n/a\n Platform: base\n\nWhat is Collective Memory?\n\nCollective Memory is the world’s decentralized memory layer where users stake on authentic content, rewarding early recognition with economic value. Early participants are already building significant point positions during this beta phase, positioning themselves for future platform developments and rewards.\n\nThis platform transforms the traditional social media model – instead of platforms extracting all value, creators earn directly and users profit from identifying significant content before others. Operating on the Base network, Collective Memory creates a transparent information marketplace where community attention, not corporate algorithms, determines what matters.\n\nCollective Memory Airdrop Details\n\npATTN points are already generating value for early users. These points represent your involvement in the ecosystem, with early beta participants gaining a significant advantage.\n\npATTN (points of Attention) forms the foundation of Collective Memory’s economy. During the current beta phase, users earn pATTN for creating memories, staking on valuable content, and daily participation.\n\nATTN will soon complement the platform as its native token, designed as the primary staking currency for the memory layer. The token is built around a sustainable, creator-first model where value flows to those who contribute value.\n\nCollective Memory is growing with 10,000+ early users already documenting over 1 million memories from nearly every country worldwide. The platform operates on a beta system that rewards:\n\nContent Creators: Earn 5% of all stakes on their memories\nEarly Stakers: Receive proportionally larger yields when their predictions prove correct\n\nActive Participants: Build positions during this early access phase\n\nStep-by-Step Guide:\nHow to Join Collective Memory and Earn pATTN Points\nDownload the App\nVisit Collective Memory website\nCurrently available on web, with iOS coming soon\nCreate Your Account\nSign up with your email address\nReceive 100 pATTN welcome bonus instantly upon registration\nUpload Your First Memories\nDocument meaningful moments, events, or insights\nEarn 10 pATTN for each memory you upload to the platform\nStart Staking on Valuable Content\nBrowse the memory layer to find significant content\nStake your pATTN on memories you believe will gain traction\nYour stake will split into the platform’s three-pot system\nParticipate Daily\nClaim 20 pATTN daily just for showing up on the platform\nMonitor your portfolio growth over time\nJoin the Community\nConnect with other Reality Mappers in Telegram\nFollow platform developments on X/Twitter\nFrequently Asked Questions\n\nWhat makes Collective Memory different from social media?\n\nTraditional platforms monetize your attention and sell it to advertisers, keeping all profits. Collective Memory creates a transparent ecosystem where value flows directly to creators and those who identify important content.\n\nHow do I earn in the Collective Memory ecosystem?\n\nThree main paths: Create valuable memories (earn 5% of all stakes), stake early on significant content (earn yield as others follow), and participate daily (earning through consistent engagement).\n\nWhen will pATTN be redeemable?\n\nThe platform is implementing a phased approach. Content creators can already redeem their profits, with expanded functionality coming for all participants.\n\nIs there a token airdrop planned?\n\nThe team has not made specific announcements about airdrops, but early platform participants positioning themselves advantageously within the ecosystem. Beta users are building their presence in the memory layer through active participation.\n\nConclusion\n\nCollective Memory represents a significant shift in how we value information. By transforming attention from an exploited resource into a fairly distributed asset, the platform is building the foundation for an information ecosystem aligned with truth and transparency.\n\nEarly adopters are already documenting significant moments and positioning themselves within this growing network. With creator rewards already live and expanded functionality rolling out in phases, Collective Memory offers a compelling opportunity for those seeking to participate in the future of decentralized information.\n\nDon't forget to follow us on Twitter, Telegram, & Facebook and subscribe our newsletter to receive new airdrops!\n\nRequirements:\n\n Telegram required\n\n Join group\n\n Twitter required\n\n Follow\n\n Phone required\n\n App install\n\n E-Mail required\n\nJOIN POINTS CAMPAIGN \n\n Report Issue",
    "steps": []
  },
  {
    "title": "Polyester",
    "url": "https://airdrops.io/polyester/",
    "description": "138°\n Airdrop Link: JOIN EARLY ACCESS WAITLIST\n Total value: n/a\n❌ Airdrop unconfirmed\n Platform: Fabric\n\nWhat is Polyester?\n\nPolyester is an innovative cryptocurrency exchange platform that aims to combine the best features of both centralized exchanges (CEXs) and decentralized exchanges (DEXs) into a single integrated solution. The platform describes itself as “built like a CEX” but “powered like a DEX,” offering users a familiar trading experience while maintaining the security benefits of decentralization. Every transaction on Polyester is powered by smart contracts, making the platform secure, transparent, and verifiable.\n\nAt its core, Polyester addresses key pain points in the cryptocurrency trading ecosystem by providing a platform that eliminates the traditional tradeoffs between centralized and decentralized exchanges. The project offers seamless deposits and withdrawals across multiple blockchains without requiring bridging, significantly reducing complexity, costs, and risks associated with cross-chain transactions. This approach allows users to enjoy the user-friendly interface and advanced features typically found in centralized exchanges while maintaining complete control over their assets.\n\nPolyester Airdrop Details\n\nThe Polyester airdrop is currently in a speculative phase as part of the project’s early access campaign. While no official token has been announced, the platform is actively building community engagement through its waitlist program, which suggests a potential future airdrop for early adopters and active participants.\n\nThe early access campaign serves as the first step toward potential rewards for early community members. By joining Polyester’s waitlist, users can position themselves to potentially receive future token distributions when the platform transitions from testnet to mainnet. This approach follows a common pattern in the crypto industry where projects reward early testers and community members with token airdrops to bootstrap adoption and create a loyal user base.\n\nFor those interested in maximizing their chances of qualifying for a potential Polyester airdrop, participating in the current early access waitlist and engaging with the platform’s community channels appears to be the best strategy. By becoming active in testing features and providing feedback, users can demonstrate their value to the ecosystem and potentially increase their allocation in any future token distribution.\n\nStep-by-Step Guide:\nHow to Join the Polyester Waitlist\n\nJoining the Polyester waitlist is your first step toward gaining early access to the platform and potentially qualifying for future token rewards. Here’s a step-by-step guide to ensure you don’t miss out:\n\nRegister with Your Email Address\nEnter your email address on the early access waitlist page\nAgree to the T&C’s and click on Join the Waitlist to continue\nFollow Polyester’s Social Media Accounts\nFollow the official Polyester account on X (Twitter)\nAlso follow related X accounts Fabric and Zipper as mentioned in the instructions\nFollowing these accounts will boost your position on the waitlist by 150 spots\nJoin Polyester’s Discord Community\nJoin Polyester’s Discord\nComplete the verification process in Discord\nJoin relevant channels to stay updated on project developments\nBeing a member of the Discord will move you up another 50 spots in the waitlist and also provide a special “Early Access 1” role\nShare Your Unique Referral Link\nAfter registration, you’ll receive a unique referral link\nShare this link with friends, family, and your social network\nFor every person who joins using your referral link, you’ll move up 50 places in the waitlist\nPromote your link in crypto communities where allowed\nStay Active and Engaged\nParticipate in community discussions and feedback sessions\nComplete any tasks or challenges announced by the Polyester team\nKeep an eye on announcements for additional opportunities to improve your position\nMonitor Your Waitlist Position\nLog in to the waitlist dashboard regularly to track your progress\nComplete any additional tasks that may appear to further improve your ranking\n\nFollowing these steps will maximize your chances of gaining early access to Polyester and potentially qualifying for any future airdrops or rewards. The more engaged you are with the project, the better positioned you’ll be for potential benefits when the platform launches officially.\n\nUnderstanding Polyester’s Technology\n\nPolyester operates on a foundation of two key technological components: Zipper and Fabric. Zipper eliminates the need for bridges by providing true multichain liquidity, while Fabric is a purpose-built blockchain designed specifically for next-generation trading systems. This infrastructure allows Polyester to offer the advanced trading features typically found on centralized exchanges while maintaining the security benefits of decentralized platforms.\n\nInstead of directly custodying external assets, Polyester trades “zAssets” — Fabric-native, wrapped versions of real assets like BTC, ETH, and DOGE. These zAssets are fully backed 1:1 and held in secure, on-chain vaults via the Zipper protocol. This means when you trade on Polyester, you’re trading verified Fabric-native assets that represent custody-backed assets from other chains.\n\nThis unique approach offers several advantages:\n\nSeamless Cross-Chain Trading: Trade assets from different blockchains without complicated bridging processes\nEnhanced Security: Assets remain secured by smart contracts rather than centralized custodians\nReduced Risk: Minimizes vulnerabilities associated with traditional cross-chain bridges\nImproved Efficiency: Faster transactions and lower fees compared to conventional DEXs\nAdvanced Trading Options: Access to perpetual futures and cross-margin trading in a decentralized environment\n\nFor traders who want advanced features without sacrificing security, Polyester’s technological framework represents a significant innovation in the cryptocurrency exchange landscape. The platform supports a wide range of assets and offers leverage options of up to 5x for most trading pairs, with select pairs supporting up to 50x leverage.\n\nFrequently Asked Questions\nWhat makes Polyester different from other exchanges?\n\nPolyester combines the user experience of centralized exchanges with the security benefits of decentralized platforms. Unlike AMM-based DEXs, Polyester uses an order book system for precise control over trades, supports unique asset pairs not found elsewhere, requires no KYC, and settles trades on-chain through Fabric. This results in fast execution, strong asset backing, and full self-custody.\n\nWill Polyester require KYC verification?\n\nNo, Polyester will operate with no KYC requirements. Users can connect their wallet and start trading without accounts or third-party permissions, maintaining anonymity and full control from first click to last transaction.\n\nWhat assets will I be able to trade on Polyester?\n\nPolyester supports a wide range of zAssets, including zipped versions of BTC, ETH, SOL, DOGE, USDT, USDC, and more. New assets are regularly added as they are zipped into Fabric via Zipper and verified as safe and relevant for trading.\n\nHow much leverage will Polyester offer?\n\nPolyester offers fixed leverage tiers per trading pair, with most perpetual listings allowing up to 5x leverage, and select pairs supporting up to 50x. These limits are hardcoded into the protocol to maintain security and minimize systemic risk.\n\nHow does Polyester handle deposits and withdrawals?\n\nPolyester provides users with unique deposit addresses for every chain, fully owned and controlled by the user. Withdrawals are executed instantly on the native chain, avoiding traditional CEX processing holds.\n\nIs Polyester’s token already available?\n\nNo, Polyester has not yet launched an official token. The current early access testnet campaign suggests a potential future token, but no specific details or timelines have been announced.\n\nHow do I move up on the waitlist?\n\nTo move up on the waitlist, follow Polyester, Fabric, and Zipper on X (Twitter) to gain 150 spots, join the Polyester Discord to gain another 50 spots, and use your unique referral link to invite friends, with each successful referral moving you up 50 places.\n\nWhen will Polyester launch officially?\n\nPolyester is currently under development, working toward a full launch with spot and perpetual trading powered by Fabric’s infrastructure. The specific launch date has not been announced yet.\n\nConclusion\n\nPolyester represents an innovative approach to cryptocurrency trading by merging the best aspects of centralized and decentralized exchanges. The platform’s unique technology stack, featuring Zipper and Fabric, enables seamless cross-chain trading without the need for traditional bridges, addressing key pain points in the current crypto exchange landscape.\n\nBy joining Polyester’s waitlist now, you position yourself to gain early access to this cutting-edge platform and potentially benefit from future token distributions. Following the strategies outlined in this guide will help maximize your chances of qualifying for any upcoming airdrops and other rewards.\n\nStay engaged with the Polyester community through their official Discord and social media channels to receive the latest updates about the platform’s development and launch timeline. As the project continues to evolve, early supporters who actively participate in the ecosystem will likely be best positioned to benefit from its growth.\n\nYou're interested in more projects that do not have any token yet and could potentially airdrop a governance token to early users in the future? Then check out our list of potential retroactive airdrops to not miss out on the next DeFi airdrop!\n\nDon't forget to follow us on Twitter, Telegram, & Facebook and subscribe our newsletter to receive new airdrops!\n\nRequirements:\n\n E-Mail required\n\nJOIN EARLY ACCESS WAITLIST \n\n Report Issue",
    "steps": []
  }
]